<a href="https://colab.research.google.com/github/akemioshiro/python_excel/blob/master/PythonExcel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np

In [0]:
np.sum([1,1])

2

In [0]:
import pandas as pd

In [0]:
from google.colab import files 
upload = files.upload()

Saving salarios.xlsx to salarios.xlsx

In [0]:
dados = pd.read_excel('salarios.xlsx')
print(dados)

         Id                            job  ... discount_salary  total_salary
0     28316    PROFESSOR EDUCACAO BASICA I  ...             0.0     2976200.0
1     28317    PROFESSOR EDUCACAO BASICA I  ...             0.0     1991060.0
2     28319   PROFESSOR EDUCACAO BASICA II  ...             0.0     1496730.0
3     28320   PROFESSOR EDUCACAO BASICA II  ...             0.0     2091770.0
4     28321   PROFESSOR EDUCACAO BASICA II  ...             0.0     1493070.0
...     ...                            ...  ...             ...           ...
9994  59325   PROFESSOR EDUCACAO BASICA II  ...             0.0     4353740.0
9995  59328   PROFESSOR EDUCACAO BASICA II  ...             0.0     1293770.0
9996  59330  AGENTE DE ORGANIZACAO ESCOLAR  ...             0.0     1106230.0
9997  59331   AGENTE DE SERVICOS ESCOLARES  ...             0.0     1060910.0
9998  59340    PROFESSOR EDUCACAO BASICA I  ...             0.0     1133430.0

[9999 rows x 10 columns]

In [0]:
pd.read_excel('salarios.xlsx', sheet_name='salario_mensal_02')

          Id                        job  ... total_salary  Unnamed: 10
0        1.0     OFICIAL ADMINISTRATIVO  ...    1929340.0          NaN
1        2.0                   SD 2C PM  ...    2265960.0          NaN
2        3.0                   1TEN  PM  ...    6933040.0          NaN
3        4.0                   MAJ   PM  ...   10568360.0          NaN
4        5.0  AG.TEC. DE ASSIT. A SAUDE  ...    3561880.0          NaN
...      ...                        ...  ...          ...          ...
1039040  NaN                        NaN  ...          NaN          NaN
1039041  NaN                        NaN  ...          NaN          NaN
1039042  NaN                        NaN  ...          NaN          NaN
1039043  NaN                        NaN  ...          NaN          NaN
1039044  NaN                        NaN  ...          NaN    4629740.0

[1039045 rows x 11 columns]

In [0]:
new_sheet = pd.read_excel('salarios.xlsx', sheet_name='salario_mensal_02')
print(new_sheet)

          Id                        job  ... total_salary  Unnamed: 10
0        1.0     OFICIAL ADMINISTRATIVO  ...    1929340.0          NaN
1        2.0                   SD 2C PM  ...    2265960.0          NaN
2        3.0                   1TEN  PM  ...    6933040.0          NaN
3        4.0                   MAJ   PM  ...   10568360.0          NaN
4        5.0  AG.TEC. DE ASSIT. A SAUDE  ...    3561880.0          NaN
...      ...                        ...  ...          ...          ...
1039040  NaN                        NaN  ...          NaN          NaN
1039041  NaN                        NaN  ...          NaN          NaN
1039042  NaN                        NaN  ...          NaN          NaN
1039043  NaN                        NaN  ...          NaN          NaN
1039044  NaN                        NaN  ...          NaN    4629740.0

[1039045 rows x 11 columns]

In [0]:
indice = pd.read_excel('salarios.xlsx', sheet_name='salario_mensal_01', index_col=0)
print(indice)

                                 job    sector  ...  discount_salary  total_salary
Id                                              ...
28316    PROFESSOR EDUCACAO BASICA I  EDUCACAO  ...              0.0     2976200.0
28317    PROFESSOR EDUCACAO BASICA I  EDUCACAO  ...              0.0     1991060.0
28319   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...              0.0     1496730.0
28320   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...              0.0     2091770.0
28321   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...              0.0     1493070.0
...                              ...       ...  ...              ...           ...
59325   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...              0.0     4353740.0
59328   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...              0.0     1293770.0
59330  AGENTE DE ORGANIZACAO ESCOLAR  EDUCACAO  ...              0.0     1106230.0
59331   AGENTE DE SERVICOS ESCOLARES  EDUCACAO  ...              0.0     1060910.0
59340    PROFESSOR EDUCACAO BASICA I  EDUCACAO  ...              0.0     1133430.0

[9999 rows x 9 columns]

In [0]:
skip = pd.read_excel('salarios.xlsx', sheet_name='salario_mensal_01', header=None, skiprows=10, index_col=0)
print(skip)

                                   1         2  ...    8          9
0                                               ...
28326   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...  0.0  2645220.0
28327   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...  0.0   875420.0
28328   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...  0.0  2656070.0
28329    PROFESSOR EDUCACAO BASICA I  EDUCACAO  ...  0.0  2246300.0
28330    PROFESSOR EDUCACAO BASICA I  EDUCACAO  ...  0.0  2252850.0
...                              ...       ...  ...  ...        ...
59325   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...  0.0  4353740.0
59328   PROFESSOR EDUCACAO BASICA II  EDUCACAO  ...  0.0  1293770.0
59330  AGENTE DE ORGANIZACAO ESCOLAR  EDUCACAO  ...  0.0  1106230.0
59331   AGENTE DE SERVICOS ESCOLARES  EDUCACAO  ...  0.0  1060910.0
59340    PROFESSOR EDUCACAO BASICA I  EDUCACAO  ...  0.0  1133430.0

[9990 rows x 9 columns]

In [0]:
col = pd.read_excel('salarios.xlsx', sheet_name='salario_mensal_01', header=None, skiprows=10, usecols='A,D')
print(col)

          0        3
0     28326  5040180
1     28327  1156240
2     28328  3017750
3     28329  2595850
4     28330  2973640
...     ...      ...
9985  59325  3023580
9986  59328  2065810
9987  59330  1104000
9988  59331  1412870
9989  59340   714680

[9990 rows x 2 columns]

In [0]:
from google.colab import drive

In [0]:
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
!ls '/content/drive/My Drive'

'13-12-2015-TI P&D.gdoc'
 1556204541Ebook_-_Ferramentas_Essncias_para_Alavancar_suas_Anlises.pdf
 57249PMV.pdf
 7000-Canais-IPTV.m3u
'Apostila POWER BI.pdf'
 Atacama
 AvalieApp.gscript
'Avalie o App (Responses).gsheet'
 caelum-java-objetos-fj11.pdf
 caelum-java-web-fj21.pdf
 caelum-python-objetos-py14.pdf
'Ciência de dados com R.pdf'
'circulo das competencias.gslides'
'Colab Notebooks'
'Comunicacao Nao-Violenta - Marshall B. Rosenberg.pdf.pdf'
 contacts.vcf
'Controle de Acesso.zip'
'Cópia de PATRICIA OSHIRO.pdf'
 CostaDoSauipe.zip
'CURSO CAELUM'
'CURSO K19'
 CV_PATRICIA_AKEMI_OSHIRO.gdoc
 Desafio
 desafio.zip
'Despesas Apto.gsheet'
 docs22.docx
'documentos (1).zip'
 documentos.zip
 Ebook_Python_basico.zip
'Escopo do Projeto.gdoc'
'Estatística Básica-Luiz Gonzaga Morettin.pdf'
'Fotos Uyuni'
 front-end-com-vuejs-da-teoria-a-pratica-sem-complicacoes.pdf
 gptw
 gptw-auth-api.zip
 gptw-message-api.zip
'gptw-plano-acao-api (1).zip'
 gptw-plano-acao-api.zip
'GPTW RAG - DASA 2018_COORDENAÇÃO ADMINISTRAÇÃO-(425).pptx'
'Grupos Whats2.pdf'
'I9 Seu Produto.gscript'
'I9 Seu Produto.gsheet'
 infos.docx
 insurance.xlsx
'Joel Grus - Data Science do zero_ Primeiras regras com o Python-Alta Books.pdf'
'Link dos ambientes.gdoc'
'links ambientes.txt'
'Lista IPTV Setembro DoutorInformatica.m3u'
 machine-learning-introducao-a-classificacao.pdf
'Mapeamento dos chamados.docx'
'Mastering Microsoft Power BI.pdf'
 Mip.zip
 monthly_salary_brazil.csv
 mpn-multi-store-web.zip
'new 3.txt'
 npm.rar
 openvpn-install-2.4.8-I602-Win10.zip
'Orçamento de gastos apt.gsheet'
'PDI 2020 - PATRICIA AKEMI OSHIRO (1).gslides'
'PDI 2020 - PATRICIA AKEMI OSHIRO.gslides'
'PDI 2020 - PATRICIA AKEMI OSHIRO.pptx'
'Planejamento Viagem 2018.gsheet'
'PWD dos ambientes.gdoc'
 python-escreva-seus-primeiros-programas.pdf
'relatorios para powerbi.zip'
'roteiro 2018.gdoc'
 sample-node-api.zip
'Sincronização Vitrine.gsheet'
 TesteDBFConnection.zip
 TOTVS
 UnidasPesquisas.zip
'Viagem 2018'

In [0]:
xlsx = pd.ExcelFile('/content/drive/My Drive/insurance.xlsx')

In [0]:
xlsx.sheet_names

['insurance', 'insurance2']

In [0]:
df1 = xlsx.parse('insurance')

In [0]:
df1.head(3)

   id  age     sex    bmi  children smoker     region    charges
0   1   19  female  27.90         0    yes  southwest  168849.24
1   2   18    male  33.77         1     no  southeast  172555.23
2   3   28    male  33.00         3     no  southeast   44494.62

In [0]:
df2  = xlsx.parse('insurance2')

In [0]:
df2.head(3)

   id  ID country
0   1   1  Brazil
1   2   2  Brazil
2   3   3  Brazil

In [0]:
df1.head()

   id  age     sex       bmi  children smoker     region      charges
0   1   19  female     27.90         0    yes  southwest    168849.24
1   2   18    male     33.77         1     no  southeast    172555.23
2   3   28    male     33.00         3     no  southeast     44494.62
3   4   33    male  22705.00         0     no  northwest  21984470.61
4   5   32    male     28.88         0     no  northwest    386685.52

In [0]:
df1.tail()

    id  age     sex    bmi  children smoker     region     charges
10  11   25    male  26.22         0     no  northeast   272132.08
11  12   62  female  26.29         0    yes  southeast  2780872.51
12  13   23    male  34.40         0     no  southwest    18268.43
13  14   56  female  39.82         0     no  southeast  1109071.78
14  15   27    male  42.13         0    yes  southeast  3961175.77

In [0]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
id          15 non-null int64
age         15 non-null int64
sex         15 non-null object
bmi         15 non-null float64
children    15 non-null int64
smoker      15 non-null object
region      15 non-null object
charges     15 non-null float64
dtypes: float64(2), int64(3), object(3)
memory usage: 1.1+ KB

In [0]:
dados.sector.unique()

array(['EDUCACAO', 'SAUDE', 'JUSTICA', 'UNIVESP'], dtype=object)

In [0]:
dados.shape

(9999, 10)

In [0]:
dados.columns

Index(['Id', 'job', 'sector', 'Month_salary', '13_salary', 'eventual_salary',
       'indemnity', 'extra_salary', 'discount_salary', 'total_salary'],
      dtype='object')

In [0]:
df1.head(15)

    id  age     sex       bmi  children smoker     region      charges
0    1   19  female     27.90         0    yes  southwest    168849.24
1    2   18    male     33.77         1     no  southeast    172555.23
2    3   28    male     33.00         3     no  southeast     44494.62
3    4   33    male  22705.00         0     no  northwest  21984470.61
4    5   32    male     28.88         0     no  northwest    386685.52
5    6   31  female     25.74         0     no  southeast    375662.16
6    7   46  female     33.44         1     no  southeast    824058.96
7    8   37  female     27.74         3     no  northwest    728150.56
8    9   37    male     29.83         2     no  northeast    640641.07
9   10   60  female     25.84         0     no  northwest  28923136.92
10  11   25    male     26.22         0     no  northeast    272132.08
11  12   62  female     26.29         0    yes  southeast   2780872.51
12  13   23    male     34.40         0     no  southwest     18268.43
13  14   56  female     39.82         0     no  southeast   1109071.78
14  15   27    male     42.13         0    yes  southeast   3961175.77

In [0]:
df1.tail(20)

    id  age     sex       bmi  children smoker     region      charges
0    1   19  female     27.90         0    yes  southwest    168849.24
1    2   18    male     33.77         1     no  southeast    172555.23
2    3   28    male     33.00         3     no  southeast     44494.62
3    4   33    male  22705.00         0     no  northwest  21984470.61
4    5   32    male     28.88         0     no  northwest    386685.52
5    6   31  female     25.74         0     no  southeast    375662.16
6    7   46  female     33.44         1     no  southeast    824058.96
7    8   37  female     27.74         3     no  northwest    728150.56
8    9   37    male     29.83         2     no  northeast    640641.07
9   10   60  female     25.84         0     no  northwest  28923136.92
10  11   25    male     26.22         0     no  northeast    272132.08
11  12   62  female     26.29         0    yes  southeast   2780872.51
12  13   23    male     34.40         0     no  southwest     18268.43
13  14   56  female     39.82         0     no  southeast   1109071.78
14  15   27    male     42.13         0    yes  southeast   3961175.77

In [0]:
dados['sector']

0       EDUCACAO
1       EDUCACAO
2       EDUCACAO
3       EDUCACAO
4       EDUCACAO
          ...
9994    EDUCACAO
9995    EDUCACAO
9996    EDUCACAO
9997    EDUCACAO
9998    EDUCACAO
Name: sector, Length: 9999, dtype: object

In [0]:
dados['sector'] == 'EDUCACAO'

0       True
1       True
2       True
3       True
4       True
        ...
9994    True
9995    True
9996    True
9997    True
9998    True
Name: sector, Length: 9999, dtype: bool

In [0]:
educacao_basico_2 = dados[dados['job'] == 'PROFESSOR EDUCACAO BASICA II']

In [0]:
educacao_basico_2

         Id                           job  ... discount_salary  total_salary
2     28319  PROFESSOR EDUCACAO BASICA II  ...             0.0     1496730.0
3     28320  PROFESSOR EDUCACAO BASICA II  ...             0.0     2091770.0
4     28321  PROFESSOR EDUCACAO BASICA II  ...             0.0     1493070.0
6     28323  PROFESSOR EDUCACAO BASICA II  ...             0.0      959480.0
9     28326  PROFESSOR EDUCACAO BASICA II  ...             0.0     2645220.0
...     ...                           ...  ...             ...           ...
9975  59241  PROFESSOR EDUCACAO BASICA II  ...             0.0     3352170.0
9987  59288  PROFESSOR EDUCACAO BASICA II  ...             0.0    10378230.0
9990  59305  PROFESSOR EDUCACAO BASICA II  ...             0.0     2216350.0
9994  59325  PROFESSOR EDUCACAO BASICA II  ...             0.0     4353740.0
9995  59328  PROFESSOR EDUCACAO BASICA II  ...             0.0     1293770.0

[5146 rows x 10 columns]

In [0]:
dados[(dados['job'] == 'PROFESSOR EDUCACAO BASICA II') & (dados['discount_salary'] > 0)]

Empty DataFrame
Columns: [Id, job, sector, Month_salary, 13_salary, eventual_salary, indemnity, extra_salary, discount_salary, total_salary]
Index: []

In [0]:
dados[(dados.sector == 'EDUCACAO') | (dados.sector=='SAUDE') | (dados.sector=='JUSTICA')].head()

      Id                           job  ... discount_salary  total_salary
0  28316   PROFESSOR EDUCACAO BASICA I  ...             0.0     2976200.0
1  28317   PROFESSOR EDUCACAO BASICA I  ...             0.0     1991060.0
2  28319  PROFESSOR EDUCACAO BASICA II  ...             0.0     1496730.0
3  28320  PROFESSOR EDUCACAO BASICA II  ...             0.0     2091770.0
4  28321  PROFESSOR EDUCACAO BASICA II  ...             0.0     1493070.0

[5 rows x 10 columns]

In [0]:
dados[dados.sector.isin(['EDUCACAO','SAUDE','JUSTICA'])].head(30)

       Id                            job  ... discount_salary  total_salary
0   28316    PROFESSOR EDUCACAO BASICA I  ...             0.0     2976200.0
1   28317    PROFESSOR EDUCACAO BASICA I  ...             0.0     1991060.0
2   28319   PROFESSOR EDUCACAO BASICA II  ...             0.0     1496730.0
3   28320   PROFESSOR EDUCACAO BASICA II  ...             0.0     2091770.0
4   28321   PROFESSOR EDUCACAO BASICA II  ...             0.0     1493070.0
5   28322  AGENTE DE ORGANIZACAO ESCOLAR  ...             0.0     7069420.0
6   28323   PROFESSOR EDUCACAO BASICA II  ...             0.0      959480.0
7   28324  AGENTE DE ORGANIZACAO ESCOLAR  ...             0.0     2963800.0
8   28325              AUXILIAR DE SAUDE  ...             0.0     1528740.0
9   28326   PROFESSOR EDUCACAO BASICA II  ...             0.0     2645220.0
10  28327   PROFESSOR EDUCACAO BASICA II  ...             0.0      875420.0
11  28328   PROFESSOR EDUCACAO BASICA II  ...             0.0     2656070.0
12  28329    PROFESSOR EDUCACAO BASICA I  ...             0.0     2246300.0
13  28330    PROFESSOR EDUCACAO BASICA I  ...             0.0     2252850.0
14  28332   PROFESSOR EDUCACAO BASICA II  ...             0.0     3273790.0
15  28333    PROFESSOR EDUCACAO BASICA I  ...             0.0     1946250.0
16  28334     DIRETOR TECNICO DE SAUDE I  ...             0.0     6764820.0
17  28335    PROFESSOR EDUCACAO BASICA I  ...             0.0     1840890.0
18  28336   PROFESSOR EDUCACAO BASICA II  ...             0.0      902610.0
19  28337   PROFESSOR EDUCACAO BASICA II  ...             0.0     4333490.0
20  28340   PROFESSOR EDUCACAO BASICA II  ...             0.0     3021960.0
21  28343    PROFESSOR EDUCACAO BASICA I  ...             0.0     1942250.0
22  28344              DIRETOR DE ESCOLA  ...             0.0     3757420.0
23  28347   PROFESSOR EDUCACAO BASICA II  ...             0.0     2263800.0
24  28351    PROFESSOR EDUCACAO BASICA I  ...             0.0     2538000.0
25  28352   PROFESSOR EDUCACAO BASICA II  ...             0.0     2252900.0
26  28353  AGENTE DE ORGANIZACAO ESCOLAR  ...             0.0     1336770.0
27  28358   PROFESSOR EDUCACAO BASICA II  ...             0.0     1320720.0
28  28359   PROFESSOR EDUCACAO BASICA II  ...             0.0     2750190.0
29  28361   PROFESSOR EDUCACAO BASICA II  ...             0.0     1988290.0

[30 rows x 10 columns]

In [0]:
dados.sector.value_counts()

EDUCACAO    8535
SAUDE       1441
UNIVESP       15
JUSTICA        8
Name: sector, dtype: int64

In [0]:
dados.job.value_counts()

PROFESSOR EDUCACAO BASICA II     5146
PROFESSOR EDUCACAO BASICA I      1763
AGENTE DE ORGANIZACAO ESCOLAR    1104
AUXILIAR DE ENFERMAGEM            259
OFICIAL ADMINISTRATIVO            169
                                 ...
ENGENHEIRO V                        1
AUXILIAR DE RADIOLOGIA              1
ANALISTA DE SISTEMAS                1
DESIGNER DE ARTE FINALISTA          1
ASSESSOR TECN.COORD.SAUDE           1
Name: job, Length: 80, dtype: int64

In [0]:
dados[(dados['sector']=='SAUDE') & (dados['job']=='OFICIAL ADMINISTRATIVO')].head(5)

        Id                     job  ... discount_salary  total_salary
352  28853  OFICIAL ADMINISTRATIVO  ...             0.0     3717110.0
379  28892  OFICIAL ADMINISTRATIVO  ...             0.0     2163440.0
578  29183  OFICIAL ADMINISTRATIVO  ...             0.0     2099490.0
580  29187  OFICIAL ADMINISTRATIVO  ...             0.0     2324510.0
666  29308  OFICIAL ADMINISTRATIVO  ...             0.0     1290940.0

[5 rows x 10 columns]

In [0]:
dados['total_salario'] = dados['Month_salary'] + dados['extra_salary']

In [0]:
dados.head(3)

      Id                           job  ... total_salary  total_salario
0  28316   PROFESSOR EDUCACAO BASICA I  ...    2976200.0      3559250.0
1  28317   PROFESSOR EDUCACAO BASICA I  ...    1991060.0      2648540.0
2  28319  PROFESSOR EDUCACAO BASICA II  ...    1496730.0      2790340.0

[3 rows x 11 columns]

In [0]:
dados.drop(columns='total_salario', axis=1, inplace=True)

In [83]:
dados.head()

      Id                           job  ... discount_salary  total_salary
0  28316   PROFESSOR EDUCACAO BASICA I  ...             0.0     2976200.0
1  28317   PROFESSOR EDUCACAO BASICA I  ...             0.0     1991060.0
2  28319  PROFESSOR EDUCACAO BASICA II  ...             0.0     1496730.0
3  28320  PROFESSOR EDUCACAO BASICA II  ...             0.0     2091770.0
4  28321  PROFESSOR EDUCACAO BASICA II  ...             0.0     1493070.0

[5 rows x 10 columns]

In [0]:
dados.drop(columns='indemnity', axis=1, inplace=True)